docs/emacs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-08-15 Wed 12:12 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Emacs</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jethro Kuan" />
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Emacs</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org6f4c956">1. Why Emacs?</a>
<ul>
<li><a href="#orgbedf7c6">1.1. Flexibility</a></li>
<li><a href="#org4de44ef">1.2. Uniform Interface</a></li>
<li><a href="#orgc04923f">1.3. Emacs has everything you need</a></li>
</ul>
</li>
<li><a href="#org4498c3d">2. How I use Emacs</a></li>
<li><a href="#orgf27b4ad">3. Undo</a></li>
<li><a href="#orgd2b5e1a">4. iedit</a></li>
<li><a href="#org211717c">5. Deleting Windows ^M (CR) characters</a></li>
<li><a href="#org189554a">6. Swiper</a></li>
</ul>
</div>
</div>
<div id="outline-container-org6f4c956" class="outline-2">
<h2 id="org6f4c956"><span class="section-number-2">1</span> Why Emacs?</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgbedf7c6" class="outline-3">
<h3 id="orgbedf7c6"><span class="section-number-3">1.1</span> Flexibility</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Emacs Lisp makes it a joy to extend, attracting a large community of
lisp hackers. Case in point: Amazon's Customer Service application
Mailman was built in Emacs Lisp.
</p>

<p>
<a href="https://sites.google.com/site/steveyegge2/tour-de-babel">https://sites.google.com/site/steveyegge2/tour-de-babel</a>
</p>
</div>
</div>

<div id="outline-container-org4de44ef" class="outline-3">
<h3 id="org4de44ef"><span class="section-number-3">1.2</span> Uniform Interface</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Everything is text, everything is in a buffer. Keyboard movements work
everywhere, no surprises.
</p>
</div>
</div>

<div id="outline-container-orgc04923f" class="outline-3">
<h3 id="orgc04923f"><span class="section-number-3">1.3</span> Emacs has everything you need</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>Web Browser (eww)</li>
<li>IRC Client (erc/irc)</li>
<li>Email Client (mu4e/notmuch/gnus)</li>
<li>Emacs X Window Manager (exwm)</li>
<li>File Browser (dired)</li>
<li>doctor?</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org4498c3d" class="outline-2">
<h2 id="org4498c3d"><span class="section-number-2">2</span> How I use Emacs</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> emacsclient</li>
<li class="off"><code>[&#xa0;]</code> Development workflow
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> TRAMP (cte.comp.nus.edu.sg)</li>
<li class="off"><code>[&#xa0;]</code> Magit</li>
<li class="off"><code>[&#xa0;]</code> Wgrep</li>
</ul></li>
<li class="off"><code>[&#xa0;]</code> Living inside Emacs: Org-mode
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Getting Things Done</li>
<li class="off"><code>[&#xa0;]</code> Reading Email</li>
<li class="off"><code>[&#xa0;]</code> Keeping up with the news: RSS Feeds</li>
<li class="off"><code>[&#xa0;]</code> Reading Papers</li>
<li class="off"><code>[&#xa0;]</code> Writing School Notes</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgf27b4ad" class="outline-2">
<h2 id="orgf27b4ad"><span class="section-number-2">3</span> Undo</h2>
<div class="outline-text-2" id="text-3">
<p>
There is no redo. Add a non-editing command to undo the undo, eg.
`C-g`. In that way `C-g C-_` performs a redo.
</p>

<p>
<a href="http://stackoverflow.com/questions/3527142/how-do-you-redo-changes-after-undo-with-emacs">http://stackoverflow.com/questions/3527142/how-do-you-redo-changes-after-undo-with-emacs</a>
</p>
</div>
</div>
<div id="outline-container-orgd2b5e1a" class="outline-2">
<h2 id="orgd2b5e1a"><span class="section-number-2">4</span> iedit</h2>
</div>
<div id="outline-container-org211717c" class="outline-2">
<h2 id="org211717c"><span class="section-number-2">5</span> Deleting Windows ^M (CR) characters</h2>
<div class="outline-text-2" id="text-5">
<p>
Simply run <code>M-x delete-trailing-whitespaces</code>
</p>
</div>
</div>
<div id="outline-container-org189554a" class="outline-2">
<h2 id="org189554a"><span class="section-number-2">6</span> Swiper</h2>
<div class="outline-text-2" id="text-6">
<p>
To enter thing-at-point into the mini-buffer, use <code>M-n</code>. This calls
<code>ivy-next-history-element</code>.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jethro Kuan</p>
<p class="date">Created: 2018-08-15 Wed 12:12</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
